Revit 2027 API
RebarConstrainedHandle.IsEqual Method
 Checks if the specified RebarConstrainedHandle is the same as 'this'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	RebarConstrainedHandle other
)
Public Function IsEqual (
	other As RebarConstrainedHandle
) As Boolean
public:
bool IsEqual(
	RebarConstrainedHandle^ other
)
member IsEqual :
        other : RebarConstrainedHandle -> bool
Parameters
other RebarConstrainedHandle
 RebarConstrainedHandle to compare with.
Return Value
Boolean
 Returns true if the specified RebarConstrainedHandle has the same type as 'this' both are for are for the same rebar. This doesn't take into account the handle behavior.
Exceptions
Exception | Condition
ArgumentException |  other is no longer valid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  RebarConstrainedHandle is no longer valid.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace